Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 徐凤年看叶眉的表情更是带了几分危险。
en_us: Xu Fengnian stared at Ye Mei with an even more dangerous and threatening expression.

source: 徐凤年看向叶漓，这丫头，说话还挺犀利。
en_us: Xu Fengnian looked at Ye Li and thought, 'This girl is really sharp-tongued.'

source: 徐凤年看她一副快要哭的模样，笑了，“你这丫头，我没说不愿意，委屈什么。”
en_us: Seeing that she was on the verge of tears, Xu Fengnian smiled and said, "Silly girl, why are you upset and aggrieved? I didn't say that I'm not willing to marry you."

source: 徐凤年看着她不怀好意的笑容，咳嗽了两声。
en_us: Xu Fengnian coughed when he saw her ill-intentioned smile.

source: 徐凤年看着自己古铜色的肌肤，又想着自己女人喜欢小白脸，一咬牙，来到了某家美容院。美容师们看到这么个极品帅哥，双眼冒心，蜂拥而上：“帅哥请问有什么需要吗？”徐凤年：“如何变白？”
en_us: [Looking at his copper-tone tanned skin and thinking about the fact that his woman liked fair-skinned boys, Xu Fengnian gritted his teeth and headed to a certain beauty salon. When the beauty therapists saw such a handsome man,they immediately swarmed towards him with joy in their eyes. "Hunk, is there anything you need?" Xu Fengnian asked, "How do I become fairer?"]

source: 徐凤年眯了眯眼，锋利的眼神如刀锋一般划过，于向阳的脊背一阵发凉。
en_us: Xu Fengnian squinted and glared daggers at Yu Xiangyang, causing the latter to feel a cold chill down his spine.

source: 徐凤年脸色微紧，有些复杂。
en_us: Xu Fengnian's face tensed up and his expression was a little complicated.

source: 徐凤年见她竟然还敢打听，脸色更不好看了，语气也是冷冷的：“你问这些做什么？”
en_us: When Xu Fengnian saw that she even dared to ask him that question, his face turned gloomier and he asked coldly, "What are you asking that question for?"

source: 徐凤年蹙了蹙眉，很是讨厌眼前这个女人，而且她要是上去了，那自己和阿漓岂不是要被隔开了吗？
en_us: Xu Fengnian frowned. He truly detested the woman in front of him. If she were to get inside the car too, wouldn't he be separated from Ye Li?

source: 徐凤年连续打了两个电话，也没有人接，不悦的皱了皱眉。
en_us: Xu Fengnian made two consecutive calls but she did not answer any of them. He frowned in displeasure.

source: 徐凤年闻言，眸中闪过一抹笑意，“我问的是你。”
en_us: Hearing her words, Xu Fengnian smiled and said, "I was asking about you."

source: 徐凤年闻言，脸色一黑，手一下拍在了她的屁股上，“胡闹，这种事情岂是你随便乱说的，乖，等吃了饭，我们就去领证。”
en_us: Hearing her words, Xu Fengnian smacked her buttocks with a hostile expression and said, "Nonsense, how can you say such things frivolously? Be good, after our meal, we'll go and get our marriage registered."

source: 徐凤年：“.....”
en_us: Xu Fengnian remained silent.

source: 徐大少的车！
en_us: 'It's Young Master Xu's car!'

source: 徐夫人上下打量她片刻，才欣慰的笑道：“真好，长大了，你妈妈要是泉下有知，肯定也会很开心的。”
en_us: Mrs. Xu scrutinized her for a moment before smiling with gratification. "Great, you're all grown up now. If your mother knows about this n the Netherworld,she'd definitely be elated."

source: 徐夫人也很快就从情绪中恢复了过来，拉住了她的手拍了拍，才看向众人，疑惑的问道：“刚刚发生什么事情了？”
en_us: Mrs. Xu soon got a grip on her emotions and held onto Ye Li's hand. She patted it and looked at everyone else before asking in apprehension, "What happened just now?"

source: 徐夫人听闻这话，脸上的笑容逐渐消失。
en_us: Upon hearing her words, Mrs. Xu's smile gradually vanished.

source: 徐夫人见是几人，目光变得慈爱：“老大老二老三都来了，哎，这是...”她的目光落到叶漓身上时，突然愣了一下，随即瞳孔微张，整个人都失态的激动了起来：“阿，阿漓！”
en_us: Seeing that it was the few of them, Mrs. Xu's gaze became much more benevolent. "Ye Luo, Ye Xun, Ye Feng, you're all here..." When she saw Ye Li, she was suddenly stunned for a while and her pupils dilated immediately. She exclaimed agitatedly, "Ye Li!"

source: 徐媛也没想到回事这样的情况，听到叶漓说这话，眼中闪过一抹恼怒。
en_us: Xu Yuan did not expect that to happen either. Her eyes were filled with fury when she heard Ye Li's words.

source: 徐媛仿佛像是明白了什么似的，点了点头。
en_us: Xu Yuan nodded and she seemed to have understood something.

source: 徐媛和温雅的笑容同时一僵。
en_us: Xu Yuan's and Wen Ya's smiles stiffened.

source: 徐媛咬了咬唇：“爷爷，我知道错了。”
en_us: Xu Yuan bit her lip and said, "Got it, Grandpa."

source: 徐媛歉意的道。
en_us: Xu Yuan said apologetically.

source: 徐媛正好走过来，她身后还跟着一个同她年级差不多大的女人，听到这话，徐媛笑道：“阿漓我大哥对你可真好，不过不会跳舞的话不大好吧，毕竟以后你嫁给我大哥的话，肯定会被邀请参加各种聚会的，到时候大家都在跳舞，就你不会，岂不是尴尬？”
en_us: Xu Yuan happened to walk over with a woman who was about the same age, behind her. Upon hearing those words, Xu Yuan smiled and said, "Ye Li, my cousin treats you so well but it doesn't seem appropriate for you to not know how to dance. After all, if you marry him in the future, you will definitely be invited to various social events. Wouldn't you be really awkward if everyone present can dance except you?"

source: 徐媛点了点头，正欲说些什么，手机突然响起。
en_us: Xu Yuan nodded and was about to say something when her phone suddenly rang.

source: 徐媛的手紧了紧，随后有些委屈的说：“我只是关心你，阿漓你看起来好不乐意的样子，若是让你生气了，那我道歉。”
en_us: Xu Yuan clenched her fists and said aggrievedly, "I'm just concerned about you. Ye Li, you seem upset. If I've angered you, I'm sorry."

source: 徐媛的旁边就是徐晗两兄妹，她笑着打了一声招呼：“小倩小晗你们都来了。”
en_us: Xu Yuan was seated beside Xu Han and Xu Qian. She greeted smilingly, "Hello, Xu Qian, Xu Han."

source: 徐媛的表情也僵住了。
en_us: Xu Yuan's expression stiffened too.

source: 徐媛眉眼闪了闪，好似不在意的收回了目光。
en_us: Xu Yuan's eyes glistened and she looked away embarrassedly.

source: 徐媛眼神微闪，随后看向了身边的女人。。
en_us: Xu Yuan's eyes flickered and she turned to look at the woman beside her.

source: 徐媛笑着点了点头：“看来你们都很喜欢他呀，等我有时间，一定去接触一下。”
en_us: Xu Yuan smiled and nodded. "Seems like you guys like him a lot. I'll definitely get to know him when I have the time."

source: 徐媛赶忙道：“可能是误会吧，我相信阿漓不是那种人。”
en_us: Xu Yuan hurriedly said, "It might be an understanding. I believe Ye Li is not such a person."

source: 徐媛蹙了蹙眉，看清说话的人是谁之后，突然就笑了：“当然记得，眉儿也来了，我还说有时间去找你们叙叙呢。”
en_us: Xu Yuan frowned and smiled after taking a clear look at who it was. "Of course I do. You're here too, Ye Mei. I was thinking of going to see you to catch up with you some time."

source: 徐媛这才将目光移到了叶漓身上。
en_us: Xu Yuan finally shifted her gaze onto Ye Li.

source: 徐媛闻言，点了点头：“那应该就是妈妈您说的那个了。”
en_us: Xu Yuan nodded when she heard his words and said, "We should be talking about the same person then."

source: 徐家夫人又送了一张特邀函给她。
en_us: 'Mrs. Xu sent her another one?'

source: 徐家很注重身份地位。
en_us: The Xu Family was very concerned about status.

source: 徐家的人对她都很热情。
en_us: All the members of the Xu Family were very kind and friendly to her, especially Xu Yuan.

source: 徐家的司机开来了车，停在了两人面前。
en_us: The Xu Family's chauffeur pulled the car over in front of the couple.

source: 徐家的餐桌上。
en_us: At this moment, there were already many people seated around the dining table of the Xu Family.

source: 徐家这一代子嗣很少。
en_us: There were very few heirs in this generation.

source: 徐晗一把抢了她的手机，“再不走等下就要被抓包了！”
en_us: Xu Han grabbed her mobile phone and exclaimed, "If you wait any longer, you're going to get arrested!"

source: 徐晗一阵烦躁的坐到了自己的位置上，看到叶漓高高扎起的马尾，几乎就快要忍不住想要狠狠欺负她的冲动。
en_us: Xu Han returned to his seat in frustration. When he saw Ye Li's high ponytail, he almost couldn't resist the impulse to bully her.

source: 徐晗一顿。
en_us: Xu Han paused.

source: 徐晗下意识的朝着叶漓看的方向看去，正好就对上了自家大表哥冰冷的目光。
en_us: Xu Han subconsciously looked at Ye Li and happened to meet the icy cold gaze of his eldest cousin, Xu Fengnian.

source: 徐晗不喜接触这样心思复杂的女生，也不希望自家妹妹接触。
en_us: Xu Han did not like interacting with girls like her who had complicated thoughts. He did not want his younger sister to get close to her either.

source: 徐晗不知道说什么。
en_us: Xu Han said something.

source: 徐晗刚走进教室，就看到了这一幕，脸色微变。
en_us: Xu Han's expression changed a little when he entered the classroom and saw that scene.

source: 徐晗原本还只是抱着怀疑的心理，可当看到叶漓在大哥身边坐下时，心里的一切质疑都碎了一地。
en_us: Xu Han was initially skeptical, but when he saw Ye Li sitting down beside his eldest cousin, all the doubts in his heart vanished.

source: 徐晗只是淡淡扫了她一眼，没有说话。
en_us: Xu Han simply glanced at her indifferently without uttering a word.

source: 徐晗心一紧，赶忙错开了目光，可等反应过来就是一阵懊恼.
en_us: Xu Han's heart tensed up and he hurriedly looked away but after recovering from the shock, he was infuriated.

source: 徐晗愣了一下，拧着眉头看她。
en_us: After being stunned for a while, Xu Han turned to look at her with a frown.

source: 徐晗抬眸扫了一眼服务员手持的黑卡，看到上面的卡号，微微蹙了蹙眉。
en_us: Xu Han looked up and glanced at the black card in the sales assistant's hand. When he saw the card number, he frowned a little.

source: 徐晗提着书包走了进来。
en_us: Xu Han entered with his schoolbag.

source: 徐晗点了点头，约莫等了一会儿，又见她不说话了，颇为烦躁的拧了拧眉，“喂，小胖。”
en_us: Xu Han nodded and waited for her reply for a while. Seeing that she had fallen silent, he rubbed the middle of her forehead in frustration and said, "Hey, little fatty?"

source: 徐晗猛不然就被她那双漂亮的眼睛勾了一下。
en_us: Xu Han was attracted to the gaze in her pretty eyes.

source: 徐晗的脸逐渐冷了下去。
en_us: Xu Han's face gradually turned cold and gloomy.

source: 徐晗的脸黑了黑。
en_us: Xu Han's face turned gloomy.

source: 徐晗瞥了一眼手机上的备注，眸光一下就冷了一下：“你还和于向阳联系！”
en_us: Xu Han glanced at the name of the contact on her mobile phone and his gaze turned extremely cold. "You're still contacting Yu Xiangyang!?!"

source: 徐晗虽然跟她接触不多，但是这个女孩之前什么心情都会表现在脸上。
en_us: Although did not have much contact with her, she often wore her heart on her sleeve.

source: 徐晗走到外面，就看到叶漓捏着手机正在打字。
en_us: Xu Han walked outside and saw Ye Li typing on her mobile phone.

source: 徐晗蹙了蹙眉，叶眉是故意暴露自己身份的，他一眼就看透了这个女人的小心思。
en_us: Xu Han frowned, knowing that Ye Mei had deliberately revealed her identity. He could tell her hidden intentions at once.

source: 徐晗蹙了蹙眉，这件事虽然听闻了一些，但是他也没有关心网络八卦的兴趣，只当是叶漓和于向阳又闹出事了，所以根本没多想。
en_us: Xiangyang frowned. Although he had heard some of it, he was not interested in paying attention to the gossip about the entertainment industry and simply took it as an incident that involved Yu Xiangyang and Ye Li. Hence, he didn't think much about it.

source: 徐晗闻言，蹙了蹙眉看向自家妹妹：“没了，换其他的。”
en_us: Upon hearing her words, Xu Han looked at his younger sister with a frown. "It's out of stock. Pick something else."

source: 徐晗难看的表情微拧，没有说话。
en_us: Xu Han maintained a sullen expression and remained silent.

source: 徐晗：“我从来没想到，我有一天会跟一本书吃醋。”
en_us: Xu Han: "I never thought that I'd one day get jealous of a book."

source: 徐晗？
en_us: 'Xu Han?'

source: 徐老二夫妻因为女儿的死，和徐凤年这个侄子彻底闹崩，视如仇敌！
en_us: Xu Yuan's parents fell out with their nephew, Xu Fengnian because of their daughter's death and they even saw him as their enemy!

source: 徐，徐凤年！
en_us: 'Xu-Xu Fengnian!'

source: 循着最显瘦的角度，叶眉拍了一张，发上了微博，“和好姐妹们一起去参加聚会啦，名媛聚会哟，到时候肯定有不少漂亮小姐姐，等我回来给大家分享，么么哒~”
en_us: Staying in a pose that would make her look the slimmest, Ye Mei snapped a photo, which she planned to post on Twitter with the caption "Going to attend a gathering together with my best friends. It's a socialites' gathering and there'll definitely be many beautiful girls later. I'll share it with you guys later. Muacks~"

source: 微博一事发酵了好几天。
en_us: The commotion on Twitter went on for a few days.

source: 微博热搜前五，几乎都是关于两人。
en_us: The top five trending searches on Twitter were almost all about the two of them.

source: 心中虽然疑惑，但是叶眉没有多问。
en_us: Despite being full of doubts, Ye Mei did not ask any more questions.

source: 心底深处一股名为嫉妒的情绪几乎要淹没了她的胸腔。
en_us: The depths of her chest were filled with jealousy.

source: 心底深处也涌出了一股子怨恨！
en_us: Resentment surged deep within his heart!

source: 心里对叶漓恨得牙痒痒，这个贱女人，绝对是故意的！
en_us: Deep down, she was filled with hatred towards Ye Li. 'This shameless bitch must have done it on purpose!'

source: 心里恨得要死，可却丝毫不敢表现半分，宛如林黛玉一般，摇摇欲坠的上了楼。
en_us: Deep down, she was filled with infuriation. However, she dared not show it at all and instead made her way upstairs meekly on an unsteady gait while shaking.

source: 心里本来就对她很不满，这会儿又不交论文，程艳说什么今儿个也得好好教训一下她。
en_us: Cheng Yan was initially already extremely annoyed and displeased with her in the first place and to make matters worse, Ye Li failed to submit her paper this time. Cheng Yan was bent on teaching her a lesson no matter what.

source: 心里虽然疑惑，但是司机也来不及多想，赶忙上了车问：“总裁，接下来要去哪里？”
en_us: Although he was filed with doubts, the chauffeur did not have time to think at all. He hurriedly got inside the car and asked, "Mr. Xu, where do we head to next?"

source: 心里这样想着，叶漓眼珠子转了转，突然就有了个邪恶的想法，故作好奇的问到：“哥哥，那个男生是谁啊？你家亲戚吗？”
en_us: While thinking about it, Ye Li rolled her eyes and a sinister idea suddenly popped up in her mind. Pretending to be curious, she asked, "Xu Fengnian, who's that boy? Is he your relative?"

source: 怎么也不相信，他们的女神竟然会做出这样的事情。
en_us: They couldn't believe that their goddess would do such a thing.

source: 怎么也不能委屈了她。
en_us: 'She can't be shortchanged and mistreated no matter what.'

source: 怎么也想不到，这女孩背后的家世竟然这么庞大。
en_us: He never expected her to come from such a powerful family.

source: 怎么会，二哥出国演讲，大哥忙着公司的事情几乎走不开，三哥的行程那么多，怎么可能会来学校请叶漓吃饭。
en_us: 'How is that possible? Ye Xun has gone abroad to give a speech while Ye Luo is busy with the matters at the office. Ye Feng has a tight schedule too. How could he come to school and take Ye Li out for lunch?'

source: 怎么变成了自己？
en_us: 'Why did it suddenly become me?'

source: 怎么可能会愿意帮她说话？
en_us: How could they be willing to speak up for her?

source: 怎么回事，邀请函不是在自己这里吗，叶漓怎么还会有？
en_us: 'What's going on? Isn't the invitation card with me? Why does Ye Li have it too?"

source: 怎么这么安静。
en_us: 'Why is she so quiet?'

source: 怕下一次再见，女孩就恢复成了之前的模样。
en_us: He was afraid that she might return to her usua; self the next time they met.

source: 总之各种各样难听的话，让一向自命清高的叶漓几乎无地自容，再加上那一天，她匆忙找自己的男神于向阳解释的时候，被那个男人一脸厌恶的叫滚，这才绝望自杀。
en_us: Bombarded by all sorts of insults, Ye Li, who had always been lofty, felt incredibly ashamed and to make matters worse, Yu Xiangyang, her idol,told her to get lost with a look of disgust when she hurriedly tried to give him an explanation. She was in so much despair that she tried to take her own life.

source: 恐是没想到这辈子还能听到叶漓这一声哥哥。
en_us: They probably did not expect to hear Ye Li calling them her brothers again in their lifetime.

source: 情敌真多。
en_us: 'So many love rivals.'

source: 想到上辈子这个女人做出的一切，她眉眼微微眯了眯。
en_us: At the thought of everything this woman had done in her previous life, she squinted a little.

source: 想到两人的差距，叶眉的心里顿时就开心了。
en_us: At the thought of the difference between the two of them, Ye Mei immediately felt elated.

source: 想到今天发生的事情，孟父恼火的不行。
en_us: Meng Fei's father was incredibly infuriated at the thought of everything that happened today.

source: 想到他们上辈子结婚的时候，自己已经是二十三岁，叶漓眸光微微一暗。
en_us: Ye Li's gaze grew dimmer when she thought about the fact that she was 23 years old when they got married in her previous life.

source: 想到对方自作主张的跟着自己，大夫人心中有些不悦，可人已经进来了，总不能赶走。
en_us: Thinking about the fact that Ye Mei had followed her presumptuously, Mrs. Xu was a little displeased. However, she couldn't chase Ye Mei away since she had already entered.

source: 想到此，叶漓嘴角勾起了一抹邪恶的微笑，开口道：“是啊，凤年哥哥，吃了晚饭再走吧。”
en_us: At the thought of this, Ye Li smirked sinisterly and said, "Yeah, Brother Fengnian, stay for dinner before you leave."

source: 想到自己之前的所作所为，程艳顿时浑身发凉。
en_us: At the thought of everything that she had done previously, Cheng Yan immediately felt a chill running through her entire body.

source: 想到自己回来的目的，徐媛的眸光闪烁了一下，朝着叶漓伸出了手：“阿漓妹妹，好久不见，你长漂亮了哦。”
en_us: At the thought of her purpose of coming home, Xu Yuan's eyes glistened and she reached her hand out to Ye Li. "Ye Li, it's been long since we last met. You've grown prettier."

source: 想到自己差点遭遇那样的场面，两人不禁都不满的看向叶漓，说道：“是啊，之前的聚会都是眉儿去的，我们可是从来就没见过你。”
en_us: At the thought of the fact that they almost had to end up in such circumstances, they couldn't help but look at Ye Li with dissatisfaction and said, "Yeah, Ye Mei turned up for all the gatherings in the past and we've never seen you before."

source: 想到自己当初的愚蠢，叶漓真恨不得给自己几个耳光。
en_us: Thinking of her own stupidity, Ye Li really wanted to give herself a few tight slaps.

source: 想到自己曾今最厌恶的人，现在却不得不被逼无奈主动接近，于向阳的心里就是一阵厌恶，他甚至有些埋怨起了叶眉，为什么她不是叶枫的亲妹妹，这样的话，自己就不用勉强自己了。
en_us: The thought of having to take the initiative to approach the person he once loathed the most, Yu Xiangyang's heart was filled with disgust and he even began to put the blame on Yu Xiangyang. He thought, 'Why isn't she Ye Feng's biological sister? If she is, I won't have to force myself to do this.'

source: 想到这个可能，叶漓整个人都陷入了一阵震惊当中。
en_us: At the thought of this possibility, Ye Li was flabbergasted.

source: 想到这个可能，叶漓的脸一下就白了。
en_us: Ye Li turned pale as soon as she thought of that possibility.

source: 想到这个可能，周围的人顿时蠢蠢欲动了起来，几乎是抢着回答，“徐夫人，刚我们看到了，是那几个小姐不知道因为什么在针对叶小姐。”
en_us: At the thought of this possibility, everyone else began to get riled up. They almost vied to answer, "Mrs. Xu, we've seen what happened just now. Those few ladies were targeting Miss Ye Li for some reason."

source: 想到这个可能，女同学慌了。
en_us: The girl panicked when she thought of this.

source: 想到这个可能，校长的老脸白了起来。
en_us: The old principal turned pale at the thought of it.

source: 想到这个场景，男人就是一阵不悦，拒绝道：“抱歉，我不习惯让别人坐我的车。”
en_us: At the thought of that scene, Xu Fengnian declined in displeasure, "I'm sorry, I'm not comfortable with giving others a ride in my car."

source: 想到这种可能，叶漓的心里顿时就冒起了火，“我不明白你们在说什么，赶紧滚开！”
en_us: At the thought of this possibility, Ye Li immediately flew into a rage and barked, "I don't understand what you people are saying, hurry and leave!"

source: 想到这种可能，她又不禁有些慌了，暗暗埋怨起了叶眉，为什么自己都没有看见，就那样说，害的她还以为自己猜对了，才会那么理直气壮的找叶漓的麻烦。
en_us: At the thought of this possibility, she couldn't help but be flustered and secretly blame Ye Mei. 'Why did Ye Mei say that even though she did not witness it with her own eyes? She caused me to think that I had guessed correctly and thus cause trouble for Ye Li self-righteously.'

source: 想到这里，两母女的心情都逐渐阴沉了下去。
en_us: At the thought of this, Xu Yuan and Kong Yun both felt gloomy.

source: 想到这里，他的瞳孔深了深。
en_us: At the thought of this, his pupils became gloomy.

source: 想到这里，几人看叶漓的眼神中已经充满了恶意。
en_us: At the thought of this, they looked at Ye Li with malicious gazes.

source: 想到这里，即使心里再怎么不甘，他也只得装作一副歉意无比的样子说告别：“这次的事情我真的很抱歉，一人做事一人当，阿枫，网上的事情我会出来澄清的，你好好在家陪陪阿漓吧。”
en_us: At the thought of this, he had no choice but to pretend to be extremely apologetic despite feeling indignant deep down."I'm really sorry for what happened this time. I should take responsibility for my own actions. Feng, I will step forth to clarify the rumors on the internet. Stay at home and accompany Li."

source: 想到这里，叶漓冷笑。
en_us: Ye Li sneered at the thought of this.

source: 想到这里，叶眉心里暗暗下了决定，一定要将叶家资产抢到手的决定！
en_us: At the thought of this, Ye Mei secretly made a decision in her heart to seize the assets of the Ye Family!

source: 想到这里，叶眉暗暗冷笑，脸上却是一脸为难，“那也行，要是你能受得了的话。”
en_us: At the thought of this, Ye Mei secretly chuckled but she nonetheless put on a conflicted look. "Sure,if you can take it."

source: 想到这里，大家的表情都变得不不自在了起来。
en_us: At the thought of this, they began to look uneasy.

source: 想到这里，她又忍不住问：“眉儿，她不是你姐姐吗？你知不知道这件事啊？她怎么会和枫神那样的大人物认识？”
en_us: At the thought of this, she couldn't help but ask, "Ye Mei, isn't she your sister? Do you know about this? How did she get to know such a famous figure like Ye Feng?"

source: 想到这里，她心思微微一动。
en_us: At the thought of this, she was a little tempted.

source: 想到这里，她眸光闪过一道精光，道：“真的吗？我也好久没去看望徐阿姨他们了，这次我一定要去。”
en_us: At the thought of this, a gleam of light flashed in her eyes and she said, "Really? I haven't visited Mrs. Xu and the others for a long time. I must go this time."

source: 想到这里，孟父的心里一定，看向了女儿。
en_us: At the thought of this, Meng Fei's father made up his mind and looked at her.

source: 想到那个男人，她的心脏狂跳了一下。
en_us: Her heart pounded wildly when she thought about that man.

source: 想着刚刚他们还把人家当成了居心不良的人对待，大家的表情就有些尴尬了起来。
en_us: They immediately looked embarrassed at the thought of how they had treated her as a dubious person.

source: 想着想着又想到那个男人了，叶漓的心里有些思念，她以为自己对徐凤年没有感情的，可当离开之后，日日夜夜脑袋里反复出现的人影却都是他，那时候她才知道，自己早已深陷无法自拔。
en_us: As Ye Li thought about it, she was reminded of that man again, and missed him a little. She thought that she had no feelings for Xu Fengnian, but after she left, images of him kept popping up in her mind every day and night. Back then, she finally knew that she had already fallen for him and she couldn't help herself.

source: 想着早逝的好友，徐夫人眼眶有些泛红。
en_us: At the thought of her close friend who had passed away at a young age, Mrs. Xu's eyes reddened.

source: 想着自己一收到消息，就放下工作往学校赶，他的心里就是一阵恼火。
en_us: At the thought of the fact that he dropped everything at work and rushed to her school after getting her text, he was filled with infuriation.

source: 想着自己心心念念了半辈子的儿媳妇终于愿意来自己家了，徐夫人的心里难以言喻的激动。
en_us: Thinking that her daughter-in-law, whom she had been longing for for half her life had finally come home, Mrs. Xu was filled with indescribable excitement.

source: 感受着周围逐渐变低的温度，她心里偷笑，在男人要生气的档口，又求生欲极强的补上一句。
en_us: Sensing the rising tension in the surrounding atmosphere, she was secretly amused. Just as he was about to flare up, she added another sentence with a strong desire to survive.

source: 感情这个叶漓一边答应徐家的婚事，一边却又在外面和别的人纠缠不清啊！
en_us: While Ye Li agreed to marry Xu Fengnian, she was also involved in a messy relationship with someone else.

source: 我不了解他又如何。
en_us: 'So what if I don't understand him?'

source: 我等着你人设崩塌的那天。
en_us: 'I shall wait for the day that you drop your pretense and facade.'

source: 或许是他的眼神太具有攻击力，叶漓很快就感受到了，她抬眸扫去，对上了对方阴沉的目光。
en_us: Perhaps because his gaze was too aggressive, Ye Li soon felt it and looked up at him, only to meet his gloomy eyes.

source: 或许用不了一个月，叶漓就能瘦到自己想要的目标。
en_us: Perhaps in less than a month, Ye Li would be able to reach her goal weight.

source: 戴着眼镜穿着白衬衫的看起来十分斯文的是叶漓的二哥，叶旬，二十四岁，帝都第一大学的老师，史上最年轻的天才教授,但这样一个优秀的男人，他也是个妹控。
en_us: The scholarly-looking, bespectacled man who was wearing a white shirt, was Ye Li's second brother, Ye Xun, a twenty-four-year-old professor of Beijing University. He was the youngest ingenious professor in history. However, an outstanding man like him also doted on his younger sister greatly.

source: 所以ys这边，得知这事后，直接就查了起来，这才知道，原来是今儿个来试礼服的叶眉拍了照还发了微博。
en_us: Hence, after finding out about the matter, the authorities of the fashion label began investigating on it. They finally found out that Ye Mei, who had gone to the store to try on the gown, had taken a photo of herself in it and even posted it onto Twitter.

source: 所以一听到叶漓的名字，顿时就联想了起来，再一看，还真是她。
en_us: When they heard Ye Li's name, they began t associate her with the person they were thinking of and after taking another look, they realized that it was really her.

source: 所以一看叶漓这个眼神几个少年顿时就怂了，这会儿想要收了手机，却已然来不及。
en_us: Hence, the few young men immediately became timid after seeing the look in Ye Li's eyes. It was too late for them to put their mobile phones away.

source: 所以为什么到了最后，你却将对你这么好的姐姐拉入了地狱深渊呢？
en_us: 'So why did you push such a good sister of yours to hell in the end?'

source: 所以也就是这样的性格，她和妈妈一样，都落到了那样不善而终的下场！
en_us: Hence, just like her mother whose personality was similar to hers, she ended up in a terrible situation!

source: 所以事先得到这个消息的叶眉，绝对不能放过这个机会。
en_us: Hence, Ye Mei, who had first received the news, was bent on seizing the opportunity.

source: 所以于向阳现在是十分出名的偶像剧大明星。
en_us: Hence, Yu Xiangyang was now an extremely famous idol drama actor.

source: 所以他才会无所顾忌。
en_us: That was why he had those scruples.

source: 所以十分严格。
en_us: Hence, the regulations were very strict.

source: 所以叶漓也是怎么舒服怎么来。
en_us: Hence, Ye Li chose to wear something that she was comfortable in.

source: 所以叶漓的记忆还是挺深的。
en_us: Hence, Ye Li had a striking memory of it.

source: 所以叶眉压根就没有往三人身上联想。
en_us: Hence, Ye Mei did not think about the three of them at all.

source: 所以叶眉对这次的比赛，势在必得。
en_us: Hence, Ye Mei was bent on winning the competition.

source: 所以叶眉将主意打在了叶漓身上。
en_us: Hence, she decided to approach Ye Li.

source: 所以叶眉的钱都不够她买奢侈品用。
en_us: Hence, Ye Mei did not have enough money to buy any luxury items.

source: 所以大家压根就没有往这方面想。
en_us: Hence, no one thought about it at all.

source: 所以她们讨伐了一天的对象，竟然是枫神的亲妹妹？
en_us: So it turned out that the person whom they had been targeting and slamming for the entire day, was actually Ye Feng's biological sister?

source: 所以当各家千金小姐相聚打好关系的聚会上，从来没有出现过叶漓的身影。
en_us: Hence, Ye Li would never attend such social gatherings where various heiresses and socialites would get together and forge closer connections.
